; domain
(define (domain beluga)
  (:requirements :typing :equality :action-costs)
  (:types
		beluga -         location
		hangar -         location
		jig -         location
		location -         object
		num -         object
		production-line -         object
		rack -         location
		side -         object
		slot -         object
		trailer -         location
		type -         object
)
  (:constants
		bside - side
		dummy-jig - jig
		dummy-slot - slot
		dummy-type - type
		fside - side
	)


  (:predicates
		(at-side ?l - location ?s - side) ; location l? accessible from side ?s
		(clear ?j - jig ?s - side) ; there is no jig before ?j on the rack when looking from ?s
		(empty ?l - location)
		(empty-size ?j - jig ?es - num) ; size of jig ?j when it was unloaded in an hangar
		(fit ?nspace - num ?jsize - num ?fspace - num ?r - rack) ; on rack ?r: ?nspace = ?jsize + ?fspace
		(free-space ?r - rack ?n - num) ; space available on rack ?r
		(in ?j - jig ?l - location)
		(is_type ?j - jig ?jt - type)
		(next-flight-to-process ?b - beluga ?nb - beluga) ; ?nb is the next flight to be processed
		(next-to ?j - jig ?nj - jig ?s - side) ; jig ?nj is before/next to jig ?j on the rack when looking from ?s
		(next_deliver ?j - jig ?jn - jig) ; ?jn is successor of ?j in delivery order to the production line
		(next_load ?jt - type ?s - slot ?ns - slot ?b - beluga)
		(next_unload ?j - jig ?nj - jig) ; ?nj is successor ?j in unload order
		(processed-flight ?b - beluga) ; Beluga ?b is currently loaded/unloaded
		(size ?j - jig ?s - num) ; current size of jig ?j
		(to_deliver ?j - jig ?pl - production-line) ; jig ?j must be delivered to production line ?pl
		(to_load ?jt - type ?s - slot ?b - beluga) ; jig of type ?jt must be loaded into slot ?s Beluga ?b
		(to_unload ?j - jig ?b - beluga) ; jig ?j must be next unload from Beluga ?b
	)


  (:functions
		(total-cost )
	)


	(:action load-beluga
		:parameters (?j - jig ?jt - type ?njt - type ?b - beluga ?t - trailer ?s - slot ?ns - slot)
		:precondition (and
			(in ?j ?t)
			(empty ?j)
			(is_type ?j ?jt)
			(processed-flight ?b)
			(to_load ?jt ?s ?b)
			(next_load ?njt ?s ?ns ?b)
			(at-side ?t bside)
		)
		:effect (and
			(in ?j ?b)
			(not (in ?j ?t))
			(empty ?t)
			(not (to_load ?jt ?s ?b))
			(to_load ?njt ?ns ?b)
			(increase (total-cost ) 1)
		)
	)





	(:action unload-beluga
		:parameters (?j - jig ?nj - jig ?t - trailer ?b - beluga)
		:precondition (and
			(in ?j ?b)
			(empty ?t)
			(at-side ?t bside)
			(processed-flight ?b)
			(to_unload ?j ?b)
			(next_unload ?j ?nj)
		)
		:effect (and
			(not (in ?j ?b))
			(in ?j ?t)
			(not (to_unload ?j ?b))
			(to_unload ?nj ?b)
			(increase (total-cost ) 1)
		)
	)





	(:action get-from-hangar
		:parameters (?j - jig ?h - hangar ?t - trailer)
		:precondition (and
			(in ?j ?h)
			(empty ?t)
			(at-side ?t fside)
		)
		:effect (and
			(not (in ?j ?h))
			(in ?j ?t)
			(empty ?h)
			(increase (total-cost ) 1)
		)
	)





	(:action deliver-to-hangar
		:parameters (?j - jig ?jn - jig ?t - trailer ?h - hangar ?pl - production-line ?s - num ?es - num)
		:precondition (and
			(in ?j ?t)
			(empty ?h)
			(at-side ?t fside)
			(to_deliver ?j ?pl)
			(next_deliver ?j ?jn)
			(size ?j ?s)
			(empty-size ?j ?es)
		)
		:effect (and
			(empty ?t)
			(empty ?j)
			(in ?j ?h)
			(not (in ?j ?t))
			(not (empty ?h))
			(not (to_deliver ?j ?pl))
			(to_deliver ?jn ?pl)
			(increase (total-cost ) 1)
			(not (size ?j ?s))
			(size ?j ?es)
		)
	)





	(:action put-down-rack
		:parameters (?j - jig ?t - trailer ?r - rack ?s - side ?jsize - num ?fspace - num ?nspace - num)
		:precondition (and
			(in ?j ?t)
			(empty ?r)
			(at-side ?t ?s)
			(at-side ?r ?s)
			(size ?j ?jsize)
			(free-space ?r ?fspace)
			(fit ?nspace ?jsize ?fspace ?r)
		)
		:effect (and
			(in ?j ?r)
			(not (in ?j ?t))
			(empty ?t)
			(not (empty ?r))
			(clear ?j bside)
			(clear ?j fside)
			(increase (total-cost ) 1)
			(not (free-space ?r ?fspace))
			(free-space ?r ?nspace)
		)
	)





	(:action stack-rack
		:parameters (?j - jig ?nj - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
		:precondition (and
			(not (= ?s ?os))
			(in ?j ?t)
			(in ?nj ?r)
			(at-side ?t ?s)
			(at-side ?r ?s)
			(clear ?nj ?s)
			(size ?j ?jsize)
			(free-space ?r ?fspace)
			(fit ?nspace ?jsize ?fspace ?r)
		)
		:effect (and
			(in ?j ?r)
			(not (in ?j ?t))
			(empty ?t)
			(not (clear ?nj ?s))
			(clear ?j ?s)
			(next-to ?j ?nj ?s)
			(next-to ?nj ?j ?os)
			(increase (total-cost ) 1)
			(not (free-space ?r ?fspace))
			(free-space ?r ?nspace)
		)
	)





	(:action pick-up-rack
		:parameters (?j - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
		:precondition (and
			(not (= ?s ?os))
			(empty ?t)
			(in ?j ?r)
			(at-side ?t ?s)
			(at-side ?r ?s)
			(clear ?j bside)
			(clear ?j fside)
			(size ?j ?jsize)
			(free-space ?r ?fspace)
			(fit ?fspace ?jsize ?nspace ?r)
		)
		:effect (and
			(in ?j ?t)
			(not (in ?j ?r))
			(empty ?r)
			(not (clear ?j bside))
			(not (clear ?j fside))
			(increase (total-cost ) 1)
			(free-space ?r ?nspace)
			(not (free-space ?r ?fspace))
		)
	)





	(:action unstack-rack
		:parameters (?j - jig ?nj - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
		:precondition (and
			(not (= ?s ?os))
			(empty ?t)
			(in ?j ?r)
			(in ?nj ?r)
			(at-side ?t ?s)
			(at-side ?r ?s)
			(clear ?j ?s)
			(next-to ?j ?nj ?s)
			(next-to ?nj ?j ?os)
			(size ?j ?jsize)
			(free-space ?r ?fspace)
			(fit ?fspace ?jsize ?nspace ?r)
		)
		:effect (and
			(in ?j ?t)
			(not (in ?j ?r))
			(not (next-to ?j ?nj ?s))
			(not (next-to ?nj ?j ?os))
			(clear ?nj ?s)
			(increase (total-cost ) 1)
			(free-space ?r ?nspace)
			(not (free-space ?r ?fspace))
		)
	)





	(:action beluga-complete
		:parameters (?b - beluga ?nb - beluga)
		:precondition (and
			(processed-flight ?b)
			(next-flight-to-process ?b ?nb)
			(to_unload dummy-jig ?b)
			(to_load dummy-type dummy-slot ?b)
		)
		:effect (and
			(not (processed-flight ?b))
			(processed-flight ?nb)
			(increase (total-cost ) 1)
		)
	)


)

; problem
(define
	(problem beluga-problem_32_s75_j3_r2_oc25_f3)
	(:domain beluga)
  (:objects
		; Numbers: {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 30, 31, 32, 35, 39}
		n00 - num
		n01 - num
		n02 - num
		n03 - num
		n04 - num
		n05 - num
		n06 - num
		n07 - num
		n08 - num
		n09 - num
		n10 - num
		n11 - num
		n12 - num
		n13 - num
		n14 - num
		n15 - num
		n16 - num
		n17 - num
		n18 - num
		n19 - num
		n20 - num
		n21 - num
		n22 - num
		n23 - num
		n24 - num
		n25 - num
		n26 - num
		n27 - num
		n28 - num
		n30 - num
		n31 - num
		n32 - num
		n35 - num
		n39 - num
		; trailers:
		beluga_trailer_1 - trailer
		factory_trailer_1 - trailer
		; Racks:
		rack00 - rack
		rack01 - rack
		; Jigs:
		jig0001 - jig
		jig0002 - jig
		jig0003 - jig
		typeE - type
		typeD - type
		typeC - type
		typeB - type
		typeA - type
		; hangars:
		hangar1 - hangar
		hangar2 - hangar
		; Beluga flights:
		beluga1 - beluga
		beluga2 - beluga
		beluga3 - beluga
		; Slots for outgoing flights:
		slot0 - slot
		; Production lines:
		pl0 - production-line
		pl1 - production-line
	)
  (:init
		; Number encoding
		; Sizes fitting rack: rack00
		(fit  n00  n04  n04 rack00)
		(fit  n01  n04  n05 rack00)
		(fit  n02  n04  n06 rack00)
		(fit  n03  n04  n07 rack00)
		(fit  n04  n04  n08 rack00)
		(fit  n00  n08  n08 rack00)
		(fit  n05  n04  n09 rack00)
		(fit  n01  n08  n09 rack00)
		(fit  n00  n09  n09 rack00)
		(fit  n06  n04  n10 rack00)
		(fit  n02  n08  n10 rack00)
		(fit  n01  n09  n10 rack00)
		(fit  n07  n04  n11 rack00)
		(fit  n03  n08  n11 rack00)
		(fit  n02  n09  n11 rack00)
		(fit  n00  n11  n11 rack00)
		(fit  n08  n04  n12 rack00)
		(fit  n04  n08  n12 rack00)
		(fit  n03  n09  n12 rack00)
		(fit  n01  n11  n12 rack00)
		(fit  n09  n04  n13 rack00)
		(fit  n05  n08  n13 rack00)
		(fit  n04  n09  n13 rack00)
		(fit  n02  n11  n13 rack00)
		(fit  n10  n04  n14 rack00)
		(fit  n06  n08  n14 rack00)
		(fit  n05  n09  n14 rack00)
		(fit  n03  n11  n14 rack00)
		(fit  n11  n04  n15 rack00)
		(fit  n07  n08  n15 rack00)
		(fit  n06  n09  n15 rack00)
		(fit  n04  n11  n15 rack00)
		(fit  n12  n04  n16 rack00)
		(fit  n08  n08  n16 rack00)
		(fit  n07  n09  n16 rack00)
		(fit  n05  n11  n16 rack00)
		(fit  n13  n04  n17 rack00)
		(fit  n09  n08  n17 rack00)
		(fit  n08  n09  n17 rack00)
		(fit  n06  n11  n17 rack00)
		(fit  n14  n04  n18 rack00)
		(fit  n10  n08  n18 rack00)
		(fit  n09  n09  n18 rack00)
		(fit  n07  n11  n18 rack00)
		(fit  n00  n18  n18 rack00)
		(fit  n15  n04  n19 rack00)
		(fit  n11  n08  n19 rack00)
		(fit  n10  n09  n19 rack00)
		(fit  n08  n11  n19 rack00)
		(fit  n01  n18  n19 rack00)
		(fit  n16  n04  n20 rack00)
		(fit  n12  n08  n20 rack00)
		(fit  n11  n09  n20 rack00)
		(fit  n09  n11  n20 rack00)
		(fit  n02  n18  n20 rack00)
		(fit  n17  n04  n21 rack00)
		(fit  n13  n08  n21 rack00)
		(fit  n12  n09  n21 rack00)
		(fit  n10  n11  n21 rack00)
		(fit  n03  n18  n21 rack00)
		(fit  n18  n04  n22 rack00)
		(fit  n14  n08  n22 rack00)
		(fit  n13  n09  n22 rack00)
		(fit  n11  n11  n22 rack00)
		(fit  n04  n18  n22 rack00)
		(fit  n19  n04  n23 rack00)
		(fit  n15  n08  n23 rack00)
		(fit  n14  n09  n23 rack00)
		(fit  n12  n11  n23 rack00)
		(fit  n05  n18  n23 rack00)
		(fit  n20  n04  n24 rack00)
		(fit  n16  n08  n24 rack00)
		(fit  n15  n09  n24 rack00)
		(fit  n13  n11  n24 rack00)
		(fit  n06  n18  n24 rack00)
		(fit  n22  n04  n26 rack00)
		(fit  n18  n08  n26 rack00)
		(fit  n17  n09  n26 rack00)
		(fit  n15  n11  n26 rack00)
		(fit  n08  n18  n26 rack00)
		(fit  n01  n25  n26 rack00)
		(fit  n23  n04  n27 rack00)
		(fit  n19  n08  n27 rack00)
		(fit  n18  n09  n27 rack00)
		(fit  n16  n11  n27 rack00)
		(fit  n09  n18  n27 rack00)
		(fit  n02  n25  n27 rack00)
		(fit  n24  n04  n28 rack00)
		(fit  n20  n08  n28 rack00)
		(fit  n19  n09  n28 rack00)
		(fit  n17  n11  n28 rack00)
		(fit  n10  n18  n28 rack00)
		(fit  n03  n25  n28 rack00)
		(fit  n26  n04  n30 rack00)
		(fit  n22  n08  n30 rack00)
		(fit  n21  n09  n30 rack00)
		(fit  n19  n11  n30 rack00)
		(fit  n12  n18  n30 rack00)
		(fit  n05  n25  n30 rack00)
		(fit  n27  n04  n31 rack00)
		(fit  n23  n08  n31 rack00)
		(fit  n22  n09  n31 rack00)
		(fit  n20  n11  n31 rack00)
		(fit  n13  n18  n31 rack00)
		(fit  n06  n25  n31 rack00)
		(fit  n03  n32  n35 rack00)
		(fit  n31  n04  n35 rack00)
		(fit  n27  n08  n35 rack00)
		(fit  n26  n09  n35 rack00)
		(fit  n24  n11  n35 rack00)
		(fit  n17  n18  n35 rack00)
		(fit  n10  n25  n35 rack00)
		(fit  n07  n32  n39 rack00)
		(fit  n35  n04  n39 rack00)
		(fit  n31  n08  n39 rack00)
		(fit  n30  n09  n39 rack00)
		(fit  n28  n11  n39 rack00)
		(fit  n21  n18  n39 rack00)
		(fit  n14  n25  n39 rack00)
		; Sizes fitting rack: rack01
		(fit  n00  n04  n04 rack01)
		(fit  n01  n04  n05 rack01)
		(fit  n02  n04  n06 rack01)
		(fit  n03  n04  n07 rack01)
		(fit  n04  n04  n08 rack01)
		(fit  n00  n08  n08 rack01)
		(fit  n05  n04  n09 rack01)
		(fit  n01  n08  n09 rack01)
		(fit  n00  n09  n09 rack01)
		(fit  n06  n04  n10 rack01)
		(fit  n02  n08  n10 rack01)
		(fit  n01  n09  n10 rack01)
		(fit  n07  n04  n11 rack01)
		(fit  n03  n08  n11 rack01)
		(fit  n02  n09  n11 rack01)
		(fit  n00  n11  n11 rack01)
		(fit  n08  n04  n12 rack01)
		(fit  n04  n08  n12 rack01)
		(fit  n03  n09  n12 rack01)
		(fit  n01  n11  n12 rack01)
		(fit  n09  n04  n13 rack01)
		(fit  n05  n08  n13 rack01)
		(fit  n04  n09  n13 rack01)
		(fit  n02  n11  n13 rack01)
		(fit  n10  n04  n14 rack01)
		(fit  n06  n08  n14 rack01)
		(fit  n05  n09  n14 rack01)
		(fit  n03  n11  n14 rack01)
		(fit  n11  n04  n15 rack01)
		(fit  n07  n08  n15 rack01)
		(fit  n06  n09  n15 rack01)
		(fit  n04  n11  n15 rack01)
		(fit  n12  n04  n16 rack01)
		(fit  n08  n08  n16 rack01)
		(fit  n07  n09  n16 rack01)
		(fit  n05  n11  n16 rack01)
		(fit  n13  n04  n17 rack01)
		(fit  n09  n08  n17 rack01)
		(fit  n08  n09  n17 rack01)
		(fit  n06  n11  n17 rack01)
		(fit  n14  n04  n18 rack01)
		(fit  n10  n08  n18 rack01)
		(fit  n09  n09  n18 rack01)
		(fit  n07  n11  n18 rack01)
		(fit  n00  n18  n18 rack01)
		(fit  n15  n04  n19 rack01)
		(fit  n11  n08  n19 rack01)
		(fit  n10  n09  n19 rack01)
		(fit  n08  n11  n19 rack01)
		(fit  n01  n18  n19 rack01)
		(fit  n16  n04  n20 rack01)
		(fit  n12  n08  n20 rack01)
		(fit  n11  n09  n20 rack01)
		(fit  n09  n11  n20 rack01)
		(fit  n02  n18  n20 rack01)
		(fit  n18  n04  n22 rack01)
		(fit  n14  n08  n22 rack01)
		(fit  n13  n09  n22 rack01)
		(fit  n11  n11  n22 rack01)
		(fit  n04  n18  n22 rack01)
		(fit  n19  n04  n23 rack01)
		(fit  n15  n08  n23 rack01)
		(fit  n14  n09  n23 rack01)
		(fit  n12  n11  n23 rack01)
		(fit  n05  n18  n23 rack01)
		(fit  n20  n04  n24 rack01)
		(fit  n16  n08  n24 rack01)
		(fit  n15  n09  n24 rack01)
		(fit  n13  n11  n24 rack01)
		(fit  n06  n18  n24 rack01)
		(fit  n22  n04  n26 rack01)
		(fit  n18  n08  n26 rack01)
		(fit  n17  n09  n26 rack01)
		(fit  n15  n11  n26 rack01)
		(fit  n08  n18  n26 rack01)
		(fit  n01  n25  n26 rack01)
		(fit  n23  n04  n27 rack01)
		(fit  n19  n08  n27 rack01)
		(fit  n18  n09  n27 rack01)
		(fit  n16  n11  n27 rack01)
		(fit  n09  n18  n27 rack01)
		(fit  n02  n25  n27 rack01)
		(fit  n27  n04  n31 rack01)
		(fit  n23  n08  n31 rack01)
		(fit  n22  n09  n31 rack01)
		(fit  n20  n11  n31 rack01)
		(fit  n13  n18  n31 rack01)
		(fit  n06  n25  n31 rack01)
		(fit  n03  n32  n35 rack01)
		(fit  n31  n04  n35 rack01)
		(fit  n27  n08  n35 rack01)
		(fit  n26  n09  n35 rack01)
		(fit  n24  n11  n35 rack01)
		(fit  n17  n18  n35 rack01)
		(fit  n10  n25  n35 rack01)
		; trailers (Beluga side):
		(empty beluga_trailer_1)
		(at-side beluga_trailer_1 bside)
		; trailers (Factory side):
		(empty factory_trailer_1)
		(at-side factory_trailer_1 fside)
		; Racks 2
		; Rack:rack00
		(empty rack00)
		(at-side rack00 bside)
		(at-side rack00 fside)
		(free-space rack00 n39)
		; Rack:rack01
		(at-side rack01 bside)
		(at-side rack01 fside)
		(free-space rack01 n17)
		(in jig0001 rack01)
		(clear jig0001 bside)
		(clear jig0001 fside)
		; Jigs (size):
		(is_type jig0001 typeC)
		(size jig0001 n18)
		(empty-size jig0001 n09)
		(is_type jig0002 typeD)
		(size jig0002 n25)
		(empty-size jig0002 n18)
		(is_type jig0003 typeC)
		(size jig0003 n18)
		(empty-size jig0003 n09)
		; hangars:
		(empty hangar1)
		(empty hangar2)
		; Flight schedule initial phase:
		(processed-flight beluga1)
		; Flight order:
		(next-flight-to-process beluga1 beluga2)
		(next-flight-to-process beluga2 beluga3)
		; Number of flights: 3
		; Incoming jigs unload order:
		; Finished Flights
		; No already completely finished Flights
		; Current Flight: beluga1
		; 0: jig0002
		(to_unload jig0002 beluga1)
		(in jig0002 beluga1)
		(next_unload jig0002 dummy-jig)
		; To Process Flights
		; Flight: beluga2
		; 0: jig0003
		(to_unload jig0003 beluga2)
		(in jig0003 beluga2)
		(next_unload jig0003 dummy-jig)
		; Flight: beluga3
		; No jigs
		(to_unload dummy-jig beluga3)
		; Outgoing jigs load order:
		; Finished Flights
		; No already completely finished Flights
		; Current Flight: beluga1
		; No jigs
		(to_load dummy-type dummy-slot beluga1)
		; To Process Flights
		; No jigs
		(to_load dummy-type dummy-slot beluga2)
		; 0: typeC
		(to_load typeC slot0 beluga3)
		(next_load dummy-type slot0 dummy-slot beluga3)
		; Production schedule:
		; Production line: pl0
		; 0: jig0001 1: jig0003
		(to_deliver jig0001 pl0)
		(next_deliver jig0001 jig0003)
		(next_deliver jig0003 dummy-jig)
		; Production line: pl1
		; 0: jig0002
		(to_deliver jig0002 pl1)
		(next_deliver jig0002 dummy-jig)
		; Action cost:
		(= (total-cost ) 0)
	)
  (:goal (and
		; All jigs empty (order defined by production schedule)
		(empty jig0001)
		(empty jig0003)
		(empty jig0002)
		; all Belugas fully unloaded:
		(to_unload dummy-jig beluga1)
		(to_unload dummy-jig beluga2)
		(to_unload dummy-jig beluga3)
		; all Belugas fully loaded:
		(to_load dummy-type dummy-slot beluga1)
		(to_load dummy-type dummy-slot beluga2)
		(to_load dummy-type dummy-slot beluga3)
	))
  (:metric minimize (total-cost))
)

; plan
1. (unload-beluga jig0002 dummy-jig beluga_trailer_1 beluga1)
   deleted: (in jig0002 beluga1) (to_unload jig0002 beluga1)
   added: (in jig0002 beluga_trailer_1) (to_unload dummy-jig beluga1)
   goals met: 4 of 9
2. (put-down-rack jig0002 beluga_trailer_1 rack00 bside n25 n39 n14)
   deleted: (in jig0002 beluga_trailer_1) (empty rack00) (free-space rack00 n39)
   added: (in jig0002 rack00) (clear jig0002 bside) (clear jig0002 fside) (free-space rack00 n14)
   goals met: 4 of 9
3. (pick-up-rack jig0002 factory_trailer_1 rack00 fside bside n25 n14 n39)
   deleted: (in jig0002 rack00) (clear jig0002 bside) (clear jig0002 fside) (free-space rack00 n14)
   added: (in jig0002 factory_trailer_1) (empty rack00) (free-space rack00 n39)
   goals met: 4 of 9
4. (deliver-to-hangar jig0002 dummy-jig factory_trailer_1 hangar1 pl1 n25 n18)
   deleted: (in jig0002 factory_trailer_1) (empty hangar1) (to_deliver jig0002 pl1) (size jig0002 n25)
   added: (empty jig0002) (in jig0002 hangar1) (to_deliver dummy-jig pl1) (size jig0002 n18)
   goals met: 5 of 9
5. (beluga-complete beluga1 beluga2)
   deleted: (processed-flight beluga1)
   added: (processed-flight beluga2)
   goals met: 5 of 9
6. (unload-beluga jig0003 dummy-jig beluga_trailer_1 beluga2)
   deleted: (in jig0003 beluga2) (to_unload jig0003 beluga2)
   added: (in jig0003 beluga_trailer_1) (to_unload dummy-jig beluga2)
   goals met: 6 of 9
7. (pick-up-rack jig0001 factory_trailer_1 rack01 fside bside n18 n17 n35)
   deleted: (in jig0001 rack01) (clear jig0001 bside) (clear jig0001 fside) (free-space rack01 n17)
   added: (in jig0001 factory_trailer_1) (empty rack01) (free-space rack01 n35)
   goals met: 6 of 9
8. (beluga-complete beluga2 beluga3)
   deleted: (processed-flight beluga2)
   added: (processed-flight beluga3)
   goals met: 6 of 9
9. (deliver-to-hangar jig0001 jig0003 factory_trailer_1 hangar2 pl0 n18 n09)
   deleted: (in jig0001 factory_trailer_1) (empty hangar2) (to_deliver jig0001 pl0) (size jig0001 n18)
   added: (empty jig0001) (in jig0001 hangar2) (to_deliver jig0003 pl0) (size jig0001 n09)
   goals met: 7 of 9
10. (get-from-hangar jig0001 hangar2 factory_trailer_1)
   deleted: (in jig0001 hangar2)
   added: (in jig0001 factory_trailer_1) (empty hangar2)
   goals met: 7 of 9
11. (put-down-rack jig0001 factory_trailer_1 rack01 fside n09 n35 n26)
   deleted: (in jig0001 factory_trailer_1) (empty rack01) (free-space rack01 n35)
   added: (in jig0001 rack01) (clear jig0001 bside) (clear jig0001 fside) (free-space rack01 n26)
   goals met: 7 of 9
12. (put-down-rack jig0003 beluga_trailer_1 rack00 bside n18 n39 n21)
   deleted: (in jig0003 beluga_trailer_1) (empty rack00) (free-space rack00 n39)
   added: (in jig0003 rack00) (clear jig0003 bside) (clear jig0003 fside) (free-space rack00 n21)
   goals met: 7 of 9
13. (pick-up-rack jig0003 factory_trailer_1 rack00 fside bside n18 n21 n39)
   deleted: (in jig0003 rack00) (clear jig0003 bside) (clear jig0003 fside) (free-space rack00 n21)
   added: (in jig0003 factory_trailer_1) (empty rack00) (free-space rack00 n39)
   goals met: 7 of 9
14. (deliver-to-hangar jig0003 dummy-jig factory_trailer_1 hangar2 pl0 n18 n09)
   deleted: (in jig0003 factory_trailer_1) (empty hangar2) (to_deliver jig0003 pl0) (size jig0003 n18)
   added: (empty jig0003) (in jig0003 hangar2) (to_deliver dummy-jig pl0) (size jig0003 n09)
   goals met: 8 of 9
15. (pick-up-rack jig0001 beluga_trailer_1 rack01 bside fside n09 n26 n35)
   deleted: (in jig0001 rack01) (clear jig0001 bside) (clear jig0001 fside) (free-space rack01 n26)
   added: (in jig0001 beluga_trailer_1) (empty rack01) (free-space rack01 n35)
   goals met: 8 of 9
16. (load-beluga jig0001 typec dummy-type beluga3 beluga_trailer_1 slot0 dummy-slot)
   deleted: (in jig0001 beluga_trailer_1) (to_load typec slot0 beluga3)
   added: (in jig0001 beluga3) (to_load dummy-type dummy-slot beluga3)
   goals met: 9 of 9
